Revit 2027 API
MEPAnalyticalModelData.IsValidNodeId Method
 Verifies if a valid analytical node id.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidNodeId(
	int nodeId
)
Public Function IsValidNodeId (
	nodeId As Integer
) As Boolean
public:
bool IsValidNodeId(
	int nodeId
)
member IsValidNodeId :
        nodeId : int -> bool
Parameters
nodeId Int32
 The node id to be verified.
Return Value
Boolean
 True if valid, otherwise false.
See Also
Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace